Catalogs/упОценочнаяШкала.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упОценочнаяШкала</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упТипРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Диапазоны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Начало</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Окончание</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/упОценочнаяШкала/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ОбработкаПроверкиЗаполнения".
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	тбзИнтервалы = ЭтотОбъект.Диапазоны.Выгрузить();
	тбзИнтервалы.Колонки.Добавить("СтрокаНомер", Новый ОписаниеТипов("Число"));
	
	Для каждого текСтрока Из тбзИнтервалы Цикл
		текСтрока.СтрокаНомер = текСтрока.НомерСтроки;
	КонецЦикла;
	тбзИнтервалы.Сортировать("Начало");
	
	текНачало 	 = Неопределено;
	текОкончание = Неопределено;
	текНомерПредыдущейСтроки = 0;
		
	Для каждого текСтрока Из  тбзИнтервалы Цикл
		
		текНомерСтроки  = текСтрока.СтрокаНомер;
		текИндексСтроки = текНомерСтроки - 1; 
		
		Если текСтрока.Начало >=текСтрока.Окончание Тогда
			
			ТекстСообщения = НСтр("ru = 'Начало интервала, должно быть меньше окончания'");
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,
				,
				"Диапазоны["+текИндексСтроки+"].Начало",
				"Объект",
				Отказ);
			Прервать;
		КонецЕсли;
		
		Если текНачало = Неопределено И текОкончание = Неопределено Тогда
			текНачало 		= текСтрока.Начало;
			текОкончание 	= текСтрока.Окончание;
			текНомерПредыдущейСтроки 	= текСтрока.СтрокаНомер;
			Продолжить;
		КонецЕсли;
		
		Если текСтрока.Начало < текОкончание Тогда
			
			ТекстСообщения = НСтр("ru = 'Интервалы строк "+текНомерСтроки + " и " + текНомерПредыдущейСтроки+" пересекаются'");
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,
				,
				"Диапазоны["+текИндексСтроки+"].Начало",
				"Объект",
				Отказ);
			Прервать;
		Иначе
			текНомерПредыдущейСтроки = текСтрока.СтрокаНомер;
			текОкончание = текСтрока.Окончание;
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры

#КонецОбласти 

#КонецЕсли
